Revit 2024 API
HostObjectSubcomponentInfo.GetCurveLoop Method
 Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public CurveLoop GetCurveLoop()
Visual Basic
Public Function GetCurveLoop As CurveLoop
Visual C++
public:
CurveLoop^ GetCurveLoop()
Return Value
 The CurveLoop.
See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace